cf/InformationRegisters/НастройкиДоступаБюджетирование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>НастройкиДоступаБюджетирование</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>cfg:CatalogRef.СтатьиБюджета</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/InformationRegisters/НастройкиДоступаБюджетирование/Forms/ФормаСпискаСценарииПользователей/Ext/Form/Module.bsl
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Параметры_ = Новый Структура;
	Параметры_.Вставить("Сценарий", Элемент.ТекущиеДанные.Сценарий);
    Параметры_.Вставить("Пользователь", Элемент.ТекущиеДанные.Пользователь);
	
	Если  Не ЗначениеЗаполнено(Элемент.ТекущиеДанные.Пользователь) Тогда
		ДатаЗапретаРедактирования=ДатаЗапретаРедактирования (Элемент.ТекущиеДанные.Сценарий);			
		Параметры_.Вставить("ДатаЗапретаРЕдактирования", ДатаЗапретаРедактирования);
	КонецЕСли;	

    ФормаВыбора = ПолучитьФорму("РегистрСведений.НастройкиДоступаБюджетирование.Форма.ФормаСценарийПользователя", Параметры_);
    ФормаВыбора.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПолныйСписок(Команда)
	ФормаВыбора = ПолучитьФорму("РегистрСведений.НастройкиДоступаБюджетирование.Форма.ФормаСписка");
	ФормаВыбора.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСценарийПользователя(Команда)
	ФормаВыбора = ПолучитьФорму("РегистрСведений.НастройкиДоступаБюджетирование.Форма.ФормаСценарийПользователя");
    ФормаВыбора.Открыть();
КонецПроцедуры

&НаСервере
Функция ДатаЗапретаРедактирования (Сценарий)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиДоступаБюджетирование.ОбъектДоступа
	|ИЗ
	|	РегистрСведений.НастройкиДоступаБюджетирование КАК НастройкиДоступаБюджетирование
	|ГДЕ
	|	НастройкиДоступаБюджетирование.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|	И НастройкиДоступаБюджетирование.Сценарий = &Сценарий";
	
	Запрос.УстановитьПараметр("Сценарий", Сценарий);
	
	РезультатЗапросаДата = Запрос.Выполнить();
	
	
	ВыборкаДетальныеЗаписи = РезультатЗапросаДата.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Возврат ВыборкаДетальныеЗаписи.ОбъектДоступа;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции
